/********** 省级数据 **********/
var mp = ['直辖市', '安徽省', '澳门特区', '福建省', '甘肃省', '广东省',
    '广西省', '贵州省', '海南省', '河北省',
    '河南省', '黑龙江省', '湖北省', '湖南省', '吉林省', '江苏省', '江西省',
    '辽宁省', '内蒙古省', '宁夏省', '青海省', '山东省', '山西省', '陕西省', '四川省',
    '台湾省', '西藏自治区', '香港特区', '新疆省', '云南省', '浙江省', '海外'];
/********** 市级数据 **********/
var mc = [
    /*直辖市*/
['北京市', '上海市', '天津市', '重庆市'],
/*安徽省*/
['合肥市', '芜湖市', '蚌埠市', '马鞍山市', '安庆市', '淮南市', '铜陵市', '黄山市', '宣城市', '池州市', '滁州市', '淮北市', '阜阳市', '六安市', '亳州市', '宿州市'],
/*澳门特区*/
['花地玛堂区', '圣安多尼堂区', '大堂区', '望德堂区', '风顺堂区', '嘉模堂区', '圣方济各堂区', '路氹城'],
/*福建省*/
['福州市', '厦门市', '漳州市', '泉州市', '三明市', '莆田市', '南平', '龙岩市', '宁德市', '平潭'],
/*甘肃省*/
['兰州市', '酒泉市', '金昌市', '天水市', '嘉峪关市', '武威市', '张掖市', '白银市', '平凉市', '庆阳市', '定西市', '陇南市', '临夏回族自治州', '甘南藏族自治州'],
/*广东省*/
['广州市', '深圳市', '珠海市', '汕头市', '佛山市', '韶关市', '湛江市', '肇庆市', '江门市', '茂名市', '惠州市', '梅州市', '汕尾市', '河源市', '阳江市', '清远市', '东莞市', '中山市', '潮州市', '揭阳市', '云浮市'],
/*广西*/
['南宁市', '柳州市', '桂林市', '梧州市', '北海市', '防城港市', '钦州市', '贵港市', '玉林市', '百色市', '贺州市', '河池市', '来宾市', '崇左市'],
/*贵州*/
['贵阳市', '六盘水市', '遵义市', '铜仁市', '黔西南布依族苗族自治州', '毕节市', '安顺市', '黔东南苗族侗族自治州', '黔南布依族苗族自治州', '河池市', '来宾市', '崇左市'],
 /*海南省*/
['海口市', '三亚市', '三沙市', '琼海市', '文昌市', '万宁市', '东方市',
'儋州市', '五指山市', '屯昌县', '定安县', '澄迈县', '临高县', '昌江黎族自治县',
'乐东黎族自治县', '白沙黎族自治县', '陵水黎族自治县', '琼中黎族苗族自治县', '保亭黎族苗族自治县 '],
/*河北省*/
['石家庄市', '唐山市', '秦皇岛市', '邯郸市', '邢台市', '保定市', '张家口市', '承德市', '沧州市', '廊坊市', '衡水市'],
/*河南省*/
['郑州市', '开封市', '洛阳市', '平顶山市', '安阳市', '鹤壁市', '新乡市', '焦作市', '濮阳市', '许昌市', '漯河市', '三门峡市', '商丘市', '周口市', '驻马店市', '南阳市', '信阳市', '济源市'],
/*黑龙江*/
['哈尔滨市', '齐齐哈尔市', '牡丹江市', '佳木斯市', '大庆市', '伊春市', '鸡西市', '鹤岗市', '双鸭山市', '七台河市', '绥化市', '黑河市', '大兴安岭地区'],
/*湖北*/
['武汉市', '黄石市', '十堰市', '荆州市', '宜昌市', '襄阳市', '鄂州市', '荆门市', '黄冈市', '孝感市', '咸宁市', '仙桃市', '潜江市', '神农架林区', '恩施土家族苗族自治州', '天门市', '随州市'],
/*湖南省*/
['长沙市', '株洲市', '湘潭市', '衡阳市', '邵阳市', '岳阳市', '常德市', '张家界市', '益阳市', '娄底市', '郴州市', '永州市', '怀化市', '湘西土家族苗族自治州'],
['长春市', '吉林市', '四平市', '辽源市', '通化市', '白山市', '白城市', '松原市', '延边朝鲜族自治州', '长白山管委会'],
/*江苏省*/
['南京市', '无锡市', '徐州市', '常州市', '苏州市', '南通市', '连云港市', '淮安市', '盐城市', '扬州市', '镇江市', '泰州市', '宿迁市'],
/*江西省*/
['南昌市', '九江市', '上饶市', '抚州市', '宜春市', '吉安市', '赣州市', '景德镇市', '萍乡市', '新余市', '鹰潭市'],
/*辽宁省*/
['沈阳市', '大连市', '鞍山市', '抚顺市', '本溪市', '丹东市', '锦州市', '营口市', '阜新市', '辽阳市', '盘锦市', '铁岭市', '朝阳市', '葫芦岛市'],
/*内蒙古*/
['呼和浩特市', '包头市', '乌海市', '赤峰市', '通辽市', '鄂尔多斯市', '呼伦贝尔市', '巴彦淖尔市', '乌兰察布市', '兴安盟', '锡林郭勒盟', '阿拉善盟'],
/*宁夏*/
['银川市', '石嘴山市', '吴忠市', '固原市', '中卫市'],
/*青海省*/
['西宁市', '海东市', '海北藏族自治州', '黄南藏族自治州', '海南藏族自治州', '果洛藏族自治州', '玉树藏族自治州', '海西蒙古族藏族自治州'],
/*山东省*/
['济南市', '青岛市', '淄博市', '枣庄市', '东营市', '烟台市', '潍坊市', '济宁市', '泰安市', '威海市', '日照市', '滨州市', '德州市', '聊城市', '临沂市', '菏泽市', '莱芜市'],
/*山西省*/
['太原市', '大同市', '阳泉市', '长治市', '晋城市', '朔州市', '晋中市', '运城市', '忻州市', '临汾市', '吕梁市'],
/*陕西省*/
['西安市', '宝鸡市', '咸阳市', '渭南市', '铜川市', '延安市', '榆林市', '安康市', '汉中市', '商洛市', '杨凌示范区'],
/*四川*/
['成都市', '绵阳市', '自贡市', '攀枝花市', '泸州市', '德阳市', '广元市', '遂宁市', '内江市', '乐山市', '资阳市', '宜宾市', '南充市', '达州市', '雅安市', '阿坝藏族羌族自治州', '甘孜藏族自治州', '凉山彝族自治州', '广安市', '巴中市', '眉山市'],
/*台湾*/
['台北市', ' 高雄市', '基隆市', '台中市', '台南市', '新竹市', '嘉义市', '台北县', '宜兰县', '桃园县', '新竹县', '苗栗县', '台中县', '彰化县', '南投县', '云林县', '嘉义县', '台南县', '高雄县', '屏东县', '台东县', '花莲县', '澎湖县'],
/*西藏*/
['拉萨市', '阿里市', '昌都市', '林芝市', '那曲市', '日喀则市', '山南市'],
/*香港*/
['香港岛', '九龙', '新界'],
/*新疆*/
['乌鲁木齐市', '阿克苏市', '阿拉尔市', '阿勒泰市', '巴音郭楞市', '博尔塔拉市', '昌吉市', '哈密市', '和田市', '喀什市', '克拉玛依市', '克孜勒苏柯尔克孜市', '石河子市', '塔城市', '图木舒克市', '吐鲁番市', '五家渠市', '伊犁市'],
/*云南省*/
['昆明市', '曲靖市', '玉溪市', '保山市', '昭通市', '丽江市', '普洱市', '临沧市', '德宏傣族景颇族自治州', '怒江僳僳族自治州', '迪庆藏族自治州', '大理白族自治州', '楚雄彝族自治州', '红河哈尼族彝族自治州', '文山壮族苗族自治州', '西双版纳傣族自治州'],
 /*浙江*/
['杭州市', '宁波市', '温州市', '绍兴市', '湖州市', '嘉兴市', '金华市', '衢州市', '舟山市', '台州市', '丽水市'],
/*海外*/
['Canada', '阿根廷', '埃及', '爱尔兰', '奥地利', '奥克兰', '澳大利亚', '巴基斯坦', '巴西', '保加利亚', '比利时', '冰岛', '朝鲜', '丹麦', '德国', '俄罗斯', '法国', '菲律宾', '芬兰', '哥伦比亚', '韩国', '荷兰', '柬埔寨', '喀麦隆', '老挝', '卢森堡', '罗马尼亚', '马达加斯加', '马来西亚', '毛里求斯', '美国', '秘鲁', '缅甸', '墨西哥', '南非', '尼泊尔', '挪威', '葡萄牙', '其它地区', '日本', '瑞典', '瑞士', '斯里兰卡', '泰国', '土耳其', '委内瑞拉', '文莱', '乌克兰', '西班牙', '希腊', '新加坡', '新西兰', '匈牙利', '以色列', '意大利', '印度', '印度尼西亚', '英国', '越南', '智利']
];
/********** 市二级数据 **********/
var mh =
[
   /*北京市*/
[
    ['昌平区', '朝阳区', '崇文区', '大兴区', '东城区', '房山区', '丰台区', '海淀区', '怀柔区', '门头沟区', '密云区', '平谷区', '石景山区', '顺义区', '通州区', '西城区', '宣武区', '延庆区'],
 /*上海市*/
    ['黄浦区', '浦东新区', '徐汇区', '长宁区', '静安区', '普陀区', '闸北区', '虹口区', '杨浦区', '郊区', '闵行区', '宝山区', '嘉定区', '金山区', '松江区', '青浦区', '奉贤区', '郊县', '崇明县'],
/*天津*/
   ['和平区', '河西区', '南开区', '河东区', '河北区', '红桥区', '东丽区', '津南区', '西青区', '北辰区', '滨海新区', '武清区', '宝坻区', '蓟县', '宁河县', '静海县'],
   /*重庆*/
 ['万州区', '黔江区', '涪陵区', '渝中区', '大渡口区', '江北区', '沙坪坝区', '九龙坡区', '南岸区', '北碚区', '渝北区', '巴南区', '长寿区', '江津区', '合川区', '永川区', '南川区', '綦江区', '大足区', '铜梁区', '璧山区', '潼南县', '荣昌县', '梁平县',
'城口县', '丰都县', '垫江县', '武隆县', '忠县', '开县', '云阳县', '奉节县', '巫山县', '巫溪县', '石柱土家族自治县', '秀山土家族苗族自治县', '酉阳土家族苗族自治县', '彭水苗族土家族自治县']
],
 /*安徽*/
[
 ['瑶海区', '庐阳区', '蜀山区', '包河区', '长丰县', '肥东县', '肥西县', '庐江县', '巢湖市', ],
 ['镜湖区', '弋江区', '鸠江区', '三山区', '无为县', '芜湖县', '繁昌县', '南陵县'],
 ['龙子湖区', '蚌山区', '禹会区', '淮上区', '五河县', '固镇县', '怀远县'],
 ['花山区', '雨山区', '博望区', '含山县', '和县', '当涂县'],
 ['迎江区', '大观区', '宜秀区', '怀宁县', '桐城市', '枞阳县', '潜山县', '太湖县', '宿松县', '望江县', '岳西县'],
 ['凤台县', '大通区', '田家庵区', '谢家集区', '八公山区', '潘集区', '毛集实验区'],
 ['铜官山区', '狮子山区', '铜陵县'],
 ['屯溪区', '黄山区', '徽州区', '歙县', '休宁县', '黟县', '祁门县', '黄山风景区'],
 ['宣州区', '郎溪县', '广德县', '宁国市', '泾县', '绩溪县', '旌德县'],
 ['贵池区', '青阳县', '石台县', '东至县', '九华山风景区'],
 ['琅琊区', '南谯区', '天长市', '明光市', '全椒县', '来安县', '凤阳县', '定远县'],
 ['相山区', '杜集区', '烈山区', '濉溪县'],
 ['颍州区', '颍泉区', '颍东区', '颍上县', '界首市', '临泉县', '阜南县', '太和县'],
 ['金安区', '裕安区', '寿县', '霍邱县', '霍山县', '寨县', '舒城县', '叶集'],
 ['埇桥区', '砀山县', '萧县', '灵璧县', '泗县'],
 ['谯城区', '蒙城县', '涡阳县', '利辛县']
],
[
 [''], [''], [''], [''], [''], [''], [''], ['']
],

/*福建*/
[
['鼓楼区', '台江区', '仓山区', '晋安区', '马尾区', '福清市', '长乐市', '闽侯县', '连江县', '罗源县', '闽清县', '永泰县'],
['思明区', '海沧区', '湖里区', '集美区', '同安区', '翔安区'],
['芗城区', '龙文区', '龙海市', '漳浦县', '南靖县', '云霄县', '平和县', '华安县', '长泰县', '诏安县', '东山县'],
['丰泽区', '鲤城区', '洛江区', '泉港区', '石狮市', '晋江市', '南安市', '惠安县', '安溪县', '永春县', '德化县', '金门县'],
['梅列区', '三元区', '永安市', '明溪县', '清流县', '宁化县', '大田县', '尤溪县', '沙县', '将乐县', '泰宁县', '建宁县'],
['城厢区', '涵江区', '荔城区', '秀屿区', '仙游县'],
['建阳区', '延平区', '邵武市', '武夷山市', '建瓯市', '顺昌县', '浦城县', '光泽县', '松溪县', '政和县'],
['新罗区', '漳平市', '长汀县', '永定县', '上杭县', '武平县', '连城县'],
['蕉城区', '东侨新区', '福安市', '福鼎市', '霞浦县', '古田县', '屏南县', '寿宁县', '周宁县', '柘荣县'],
['潭城', '苏澳', '流水', '澳前', '北厝', '平原', '敖东']
],
/*甘肃*/
[
['城关区', '七里河区', '西固区', '安宁区', '红古区', '兰州新区', '榆中县', '皋兰县', '永登县', '甘肃矿区'],
['肃州区', '新城区', '甘肃矿区', '东风场区', '玉门市', '敦煌市', '瓜州县', '金塔县', '肃北蒙古族自治县', '阿克塞哈萨克族自治县'],
['金川区', '永昌县'],
['秦州区', '麦积区', '清水县', '秦安县', '甘谷县', '武山县', '张家川回族自治县'],
['峪泉镇', '新城镇', '文殊镇'],
['凉州区', '古浪县', '民勤县', '天祝藏族自治县'],
['甘州区', '山丹县', '民乐县', '临泽县', '高台县', '肃南裕固族自治县'],
['白银区', '平川区', '会宁县', '靖远县', '景泰县'],
['崆峒区', '泾川县', '灵台县', '崇信县', '华亭县', '庄浪县', '静宁县'],
['西峰区', '正宁县', '华池县', '合水县', '宁县', '庆城县', '镇原县', '环县'],
['安定区', '通渭县', '陇西县', '漳县', '渭源县', '岷县', '临洮县'],
['武都区', '成县', '两当县', '徽县', '西和县', '礼县', '康县', '文县', '宕昌县'],
['临夏市', '临夏县', '康乐县', '广河县', '永靖县', '和政县', '东乡族自治县', '积石山保安族东乡族撒拉族自治县'],
['合作市', '夏河县', '玛曲县', '舟曲县', '碌曲县', '迭部县', '临潭县', '卓尼县']
],
/*广东*/
[
['越秀区', '荔湾区', '海珠区', '天河区', '白云区', '黄埔区', '花都区', '番禺区', '南沙区', '增城区', '从化区'],
['福田区', '罗湖区', '南山区', '盐田区', '宝安区', '龙岗区', '光明新区', '龙华新区', '坪山新区', '大鹏新区'],
['香洲区', '斗门区', '金湾区'],
['金平区', '龙湖区', '濠江区', '潮南区', '潮阳区', '澄海区', '南澳县'],
['禅城区', '高明区', '三水区', '南海区', '顺德区'],
['浈江区', '武江区', '曲江区', '乐昌市', '南雄市', '始兴县', '仁化县', '翁源县', '新丰县', '乳源瑶族自治县'],
['赤坎区', '霞山区', '坡头区', '麻章区', '廉江市', '吴川市', '雷州市', '遂溪县', '徐闻县'],
['端州区', '鼎湖区', '高要市', '四会市', '广宁县', '怀集县', '封开县', '德庆县'],
['江海区', '蓬江区', '新会区', '台山市', '鹤山市', '开平市', '恩平市'],
['茂南区', '电白区', '高州市', '化州市', '信宜市'],
['惠城区', '惠阳区', '博罗县', '龙门县', '惠东县'],
['梅江区', '梅县区', '兴宁市', '大埔县', '丰顺县', '五华县', '平远县', '蕉岭县'],
['城区', '陆丰市', '海丰县', '陆河县'],
['源城区', '龙川县', '连平县', '东源县', '和平县', '紫金县'],
['江城区', '阳春市', '阳西县', '阳东县'],
['清城区', '清新区', '英德市', '连州市', '佛冈县', '阳山县', '连山壮族瑶族自治县', '连南瑶族自治县'],
['莞城街道', '南城街道', '东城街道', '万江街道', '石碣镇', '石龙镇', '茶山镇', '石排镇', '企石镇', '横沥镇', '桥头镇', '谢岗镇', '东坑镇', '常平镇', '寮步镇', '大朗镇', '黄江镇', '清溪镇', '塘厦镇', '凤岗镇', '长安镇', '虎门镇', '厚街镇', '沙田镇', '道滘镇', '洪梅镇', '麻涌镇', '中堂镇', '高埗镇', '樟木头镇', '大岭山镇', '望牛墩镇'],
['石岐街道', '东区街道', '西区街道', '南区街道', '五桂山街道', '中山港街道', '黄圃镇', '南头镇', '东凤镇', '阜沙镇', '小榄镇', '东升镇', '古镇镇', '横栏镇', '三角镇', '民众镇', '南朗镇', '港口镇', '大涌镇', '沙溪镇', '三乡镇', '板芙镇', '神湾镇', '坦洲镇'],
['湘桥区', '潮安区', '饶平县'],
['榕城区', '揭东区', '普宁市', '惠来县', '揭西县'],
['云城区', '罗定市', '新兴县', '郁南县', '云安县']
],
//广西
[
['青秀区', '兴宁区', '西乡塘区', '江南区', '良庆区', '邕宁区', '武鸣县', '隆安县', '马山县', '上林县', '宾阳县', '横县'],
['柳北区', '柳南区', '城中区', '鱼峰区', '柳城县', '柳江县', '鹿寨县', '融安县', '融水苗族自治县', '三江侗族自治县'],
['象山区', '秀峰区', '叠彩区', '七星区', '雁山区', '临桂区', '阳朔县', '灵川县', '全州县', '平乐县', '兴安县', '灌阳县', '荔浦县', '资源县', '永福县', '龙胜各族自治县', '恭城瑶族自治县'],
['长洲区', '万秀区', '龙圩区', '岑溪市', '苍梧县', '蒙山县', '藤县'],
['海城区', '银海区', '铁山港区', '合浦县'],
['港口区', '防城区', '东兴市', '上思县'],
['钦南区', '钦北区', '灵山县', '浦北县'],
['港北区', '港南区', '覃塘区', '桂平市', '平南县'],
['玉州区', '福绵区', '北流市', '容县', '陆川县', '博白县', '兴业县'],
['右江区', '田阳县', '田东县', '平果县', '德保县', '靖西县', '那坡县', '凌云县', '乐业县', '田林县', '西林县', '隆林各族自治县'],
['八步区', '平桂管理区', '昭平县', '钟山县', '富川瑶族自治县'],
['金城江区', '宜州市', '南丹县', '天峨县', '凤山县', '东兰县', '巴马瑶族自治县', '都安瑶族自治县', '大化瑶族自治县', '罗城仫佬族自治县', '环江毛南族自治县'],
['兴宾区', '合山市', '象州县', '武宣县', '忻城县', '金秀瑶族自治县'],
['江州区', ' 凭祥市', '扶绥县', '宁明县', '龙州县', '大新县', '天等县']
],
//贵州
[
['云岩区', '南明区', '观山湖区', '花溪区乌当区', '白云区', '清镇市', '修文县', '息烽县', '开阳县'],
['钟山区', '六枝特区', '水城县', '盘县', '仁怀市'],
['碧江区', '万山区', '德江县', '石阡县', '思南县', '江口县', '松桃苗族自治县', '印江土家族苗族自治县', '沿河土家族自治县', '玉屏侗族自治县'],
['兴义市', '兴仁县', '安龙县', '普安县', '晴隆县', '贞丰县', '册亨县', '望谟县'],
['七星关区', '黔西县', '大方县', '金沙县纳雍县', '赫章县', '织金县', '威宁彝族回族苗族自治县'],
['凯里市', '天柱县', '榕江县', '施秉县', '麻江县', '锦屏县', '台江县', '剑河县', '三穗县', '黄平县', '从江县', '岑巩县', '丹寨县', '镇远县', '黎平县', '雷山县'],
['都匀市', '独山县', '荔波县', '贵定县', '瓮安县', '惠水县', '长顺县', '平塘县', '罗甸县', '三都水族自治县', '福泉市'],
],
/*海南省*/
[
['秀英区', '龙华区', '琼山区', '美兰区'],
['吉阳区', '崖州区', '天涯区', '海棠区'],
['西沙群岛', '中沙群岛', '南沙群岛'],
['嘉积镇', '万泉镇', '石壁镇', '中原镇', '博鳌镇', '阳江镇', '龙江镇', '潭门镇', '塔洋镇', '长坡镇', '大路镇', '会山镇'],
['文城镇', '重兴镇', '蓬莱镇', '会文镇', '东路镇', '潭牛镇', '东阁镇', '文教镇', '东郊镇', '龙楼镇', '昌洒镇', '翁田镇', '抱罗镇', '冯坡镇', '锦山镇', '铺前镇', '公坡镇'],
['万城镇', '龙滚镇', '山根镇', '和乐镇', '后安镇', '大茂镇', '东澳镇', '礼纪镇', '长丰镇', '北大镇', '南桥镇', '三更罗镇'],
['八所镇', '东河镇', '大田镇', '感城镇', '板桥镇', '三家镇', '四更镇', '新龙镇', '天安乡', '江边乡'],
['定城镇', '新竹镇', '龙湖镇', '黄竹镇', '雷鸣镇', '龙门镇', '龙河镇', '岭口镇', '翰林镇', '富文镇'],
['屯城镇', '新兴镇', '枫木镇', '南吕镇', '南坤镇', '坡心镇', '西昌镇'],
['金江镇', '瑞溪镇', '永发镇', '老城镇', '加乐镇', '文儒镇', '福山镇', '桥头镇', '中兴镇', '仁兴镇', '大丰镇'],
['临城镇', '波莲镇', '东英镇', '博厚镇', '皇桐镇', '多文镇', '和舍镇', '南宝镇', '新盈镇', '调楼镇', '加来镇'],
['营根镇', '湾岭镇', '黎母山镇', '红毛镇', '长征镇', '中平镇', '和平镇', '什运乡', '上安乡', '吊罗山乡'],
['保城镇', '什玲镇', '加茂镇', '响水镇', '新政镇', '三道镇', '六弓乡', '南林乡', '毛感乡'],
['牙叉镇', '七坊镇', '邦溪镇', '打安镇', '细水乡', '元门乡', '南开乡', '阜龙乡', '青松乡', '金波乡', '荣邦乡'],
['石碌镇', '叉河镇', '十月田镇', '乌烈镇', '海尾镇', '南罗镇', '太坡镇', '昌化镇', '七差乡', '保平乡', '昌城乡', '王下乡'],
['抱由镇', '万冲镇', '大安镇', '志仲镇', '千家镇', '九所镇', '利国镇', '黄流镇', '佛罗镇', '尖峰镇', '莺歌海镇'],
['椰林镇', '新村镇', '英州镇', '本号镇', '隆广镇', '三才镇', '光坡镇', '文罗镇', '黎安镇', '提蒙乡', '群英乡'],
['新干冲区', '三都镇']
],
/*河北省*/
[
['长安区', '桥西区', '新华区', '井陉矿区', '裕华区', '藁城区', '鹿泉区', '栾城区', '井陉县', '正定县', '行唐县', '灵寿县', '高邑县', '深泽县', '赞皇县', '无极县', '平山县', '元氏县', '赵县', '辛集市', '晋州市', '新乐市'],
['路北区', '路南区', '古冶区', '开平区', '丰南区', '丰润区', '曹妃甸区', '滦县', '滦南县', '乐亭县', '迁西县', '玉田县', '遵化市', '迁安市'],
['海港区', '山海关区', '北戴河区', '青龙满族自治县', '昌黎县', '抚宁县', '卢龙县'],
['邯山区', '丛台区', '复兴区', '峰峰矿区', '邯郸县', '临漳县', '成安县', '大名县', '涉县', '磁县', '肥乡县', '永年县', '邱县', '鸡泽县', '广平县', '馆陶县', '魏县', '曲周县', '武安市'],
['桥东区', '桥西区', '邢台县', '临城县', '内丘县', '柏乡县', '隆尧县', '任县', '南和县', '宁晋县', '巨鹿县', '新和县', '广宗县', '平乡县', '威县', '清河县', '临西县', '南宫市', '沙河市'],
['新市区', '北市区', '南市区', '满城县', '清苑县', '涞水县', '阜平县', '徐水县', '定兴县', '唐县', '高阳县', '容城县', '涞源县', '望都县', '安新县', '易县', '曲阳县', '蠡县', '顺平县', '博野县', '雄县', '涿州市', '定州市', '安国市', '高碑店市'],
['桥东区', '桥西区', '宣化区', '下花园区', '宣化县', '张北县', '康保县', '沽源县', '尚义县', '蔚县', '阳原县', '怀安县', '万全县', '怀来县', '涿鹿县', '赤城县', '崇礼县'],
['运河区', '新华区', '沧县', '青县', '东光县', '海兴县', '盐山县', '肃宁县', '南皮县', '吴桥县', '献县', '孟村回族自治县', '泊头市', '任丘市', '黄骅市', '河间市'],
['广阳区', '安次区', '固安县', '永清县', '香河县', '大城县', '文安县', '大厂回族自治县', '霸州市', '三河市'],
['桃城区', '枣强县', '武邑县', '武强县', '饶阳县', '安平县', '故城县', '景县', '阜城县', '冀州市', '深州市']
],
/*河南省*/
[
['中原区', '二七区', '管城回族区', '金水区', '上街区', '惠济区', '高新区', '经济开发区', '中牟县', '巩义市', '荥阳市', '新密市', '新郑市', '登封市'],
['龙亭区', '顺河回族区', '鼓楼区', '禹王台区', '开封新区（金明区）', '杞县', '通许县', '尉氏县', '开封县', '兰考县'],
['老城区', '西工区', '瀍河回族区', '涧西区', '吉利区 ', '洛龙区', '孟津县', '新安县', '栾川县', '嵩县', '汝阳县', '宜阳县', '洛宁县', '伊川县', '偃师市'],
['新华区', '卫东区', '石龙区', '湛河区', '宝丰县', '叶县', '鲁山县', '郏县', '舞钢市', '汝州市'],
['文峰区', '北关区', '殷都区', '龙安区', '安阳县', '汤阴县', '滑县', '内黄县', '林州市'],
['鹤山区', '山城区', '淇滨区', '浚县', '淇县'],
['红旗区', '卫滨区', '牧野区', '凤泉区', '新乡县', '获嘉县', '原阳县', '延津县', '封丘县', '长垣县', '卫辉市', '辉县市'],
['解放区', '中站区', '马村区', '山阳区', '修武县', '博爱县', '武陟县', '温县', '沁阳市', '孟州市'],
['华龙区', '濮阳高新技术产业开发区', '清丰县', '南乐县', '范县', '台前县', '濮阳县'],
['魏都区', '许昌县', '鄢陵县', '襄城县', '禹州市', '长葛市'],
['临颍县', '舞阳县', '郾城区', '源汇区', '召陵区', '经济开发区'],
['湖滨区', '渑池县', '陕县', '卢氏县', '义马市', '灵宝市'],
['梁园区', '睢阳区', '经济开发区', '民权县', '睢县', '宁陵县', '柘城县', '虞城县', '夏邑县', '永城市'],
['川汇区', '扶沟县', '西华县', '商水县', '沈丘县', '郸城县', '淮阳县', '太康县', '鹿邑县', '项城市'],
['驿城区', '西平县', '上蔡县', '平舆县', '正阳县', '确山县', '泌阳县', '汝南县', '遂平县', '新蔡县'],
['宛城区', '卧龙区', '南召县', '方城县', '西峡县', '镇平县', '内乡县', '淅川县', '社旗县', '唐河县', '新野县', '桐柏县', '邓州市', '南阳高新技术开发区', '鸭河工区', '官庄工业区', '南阳新区'],
['浉河区', '平桥区', '羊山新区', '罗山县', '潢川县', '固始县', '息县', '淮滨县', '光山县', '商城县', '新县', '潢川开发区', '鸡公山管理区', '上天梯管理区', '羊山新区', '南湾湖风景区', '信阳工业城'],
['邵原镇', '下冶镇', '王屋镇', '思礼镇', '大峪镇', '坡头镇', '承留镇', '轵城镇', '梨林镇', '克井镇', '五龙口镇', '北海街道', '玉泉街道', '天坛街道', '沁园街道', '济水街道'],
],
/*黑龙江*/
[
['松北区', '南岗区', '道里区', '道外区', '香坊区', '平房区', '呼兰区', '阿城区', '双城区', '五常市', '尚志市', '宾县', '巴彦县', '延寿县', '木兰县', '通河县', '方正县', '依兰县'],
['龙沙区', '建华区', '铁锋区', '昂昂溪区', '碾子山区', '富拉尔基区', '梅里斯达斡尔族区', '讷河市', '龙江县', '富裕县', '甘南县', '拜泉县', '依安县', '克山县', '克东县', '泰来县'],
['东安区', '西安区', '阳明区', '爱民区', '海林市', '穆棱市', '宁安市', '林口县', '东宁县', '绥芬河市'],
['前进区', '向阳区', '东风区', '郊区', '同江市', '富锦市', '桦川县', '桦南县', '汤原县', '抚远县'],
['萨尔图区', '让胡路区', '龙凤区', '红岗区', '大同区', '肇源县', '肇州县', '林甸县', '杜尔伯特蒙古族自治县'],
['伊春区', '南岔区', '带岭区', '友好区', '西林区', '美溪区', '翠峦区', '五营区', '红星区', '新青区', '金山屯区', '汤旺河区', '上甘岭区', '乌伊岭区', '乌马河区', '铁力市', '嘉荫县'],
['鸡冠区', '恒山区', '滴道区', '梨树区', '麻山区', '城子河区', '密山市', '虎林市', '鸡东县'],
['兴山区', '向阳区', '工农区', '南山区', '东山区', '兴安区', '萝北县', '绥滨县'],
['尖山区', '岭东区', '宝山区', '四方台区', '集贤县', '宝清县', '友谊县', '饶河县'],
['桃山区', '新兴区', '茄子河区', '勃利县'],
['北林区', '安达市', '肇东市', '海伦市', '望奎县', '兰西县', '青冈县', '明水县', '绥棱县', '庆安县'],
['爱辉区', '北安市', '五大连池市', '嫩江县', '孙吴县', '逊克县'],
['加格达奇区', '松岭区', '呼中区', '呼玛县', '塔河县', '漠河县']
],
/*湖北*/
[
['硚口区', '汉阳区', '武昌区', '青山区', '洪山区', '东西湖区', '黄陂区', '江夏区', '蔡甸区', '汉南区', '新洲区'],
['黄石港区', '西塞山区', '下陆区', '铁山区', '大冶市', '阳新县'],
['茅箭区', '张湾区', '郧阳区', '郧西县', '竹山县', '竹溪县', '房县', '丹江口市'],
['沙市区', '荆州区', '公安县', '监利县', '江陵县', '石首市', '洪湖市'],
['西陵区', '伍家岗区', '点军区', '猇亭区', '夷陵区', '远安县', '兴山县', '秭归县', '宜都市', '当阳市', '枝江市', '五峰土家族自治县', '长阳土家族自治县'],
['襄城区', '樊城区', '襄州区', '南漳县', '谷城县', '保康县', '枣阳市', '宜城市', '老河口市'],
['梁子湖区', '华容区', '鄂城区'],
['东宝区', '掇刀区', '京山县', '沙洋县', '钟祥市'],
['黄州区', '团风县', '红安县', '罗田县', '英山县', '浠水县', '蕲春县', '黄梅县', '麻城市', '武穴市'],
['孝南区', '孝昌县', '大悟县', '云梦县', '应城市', '安陆市', '汉川市'],
['咸安区', '嘉鱼县', '通城县', '崇阳县', '通山县', '赤壁市'],
['干河街道（高新技术产业园）', '龙华山街道', '沙嘴街道', '郑场镇', '毛嘴镇', '剅河镇', '三伏潭镇', '胡场镇', '长埫口镇', '西流河镇（化工产业园）', '彭场镇（彭场工业园）', '沙湖镇', '杨林尾镇', '张沟镇', '郭河镇', '沔城回族镇', '通海口镇', '陈场镇',
'仙桃经济开发区', '仙桃工业园', '沙湖原种场', '九合垸原种场', '排湖风景区'],
['园林办事处', '广华办事处', '杨市办事处', '周矶办事处', '泽口办事处', '泰丰办事处', '高场办事处',
'熊口镇', '竹根滩镇', '高石碑镇', '老新镇', '王场镇', '渔洋镇', '龙湾镇', '浩口镇', '积玉口镇', '张金镇',
'白鹭湖管理区 ', '总口管理区', '熊口农场管理区', '运粮湖管理区', '后湖管理区', '周矶管理区',
'潜江开发区'],
['松柏镇', '阳日镇', '木鱼镇', '红坪镇', '新华镇', '宋洛乡', '九湖乡', '下谷坪土家族乡'],
['恩施市', '利川市', '建始县', '巴东县', '咸丰县', '宣恩县', '来凤县', '鹤峰县'],
['竟陵街道办事处', '杨林街道办事处', '侯口街道办事处', '多宝镇', '拖市镇', '张港镇', '蒋场镇', '汪场镇', '渔薪镇', '黄潭镇', '岳口镇', '横林镇', '彭市镇', '麻洋镇', '干驿镇', '马湾镇', '卢市镇', '小板镇', '九真镇', '皂市镇', '胡市镇', '石河镇', '佛子山镇', '净潭乡'],
['曾都区', '广水市', '随县']
],
/*湖南省*/
[
['芙蓉区', '天心区', '岳麓区', '开福区', '雨花区', '望城区', '长沙县', '宁乡县', '浏阳市'],
['天元区', '荷塘区', '芦淞区', '石峰区', '株洲县', '攸县', '茶陵县', '炎陵县', '醴陵市', '云龙示范区'],
['雨湖区', '岳塘区', '湘潭县', '韶山市', '湘乡市'],
['雁峰区', '石鼓区', '珠晖区', '蒸湘区', '南岳区', '衡阳县', '衡南县', '衡山县', '衡东县', '祁东县', '耒阳市', '常宁市'],
['双清区', '大祥区', '北塔区', '邵东县', '新邵县', '邵阳县', '隆回县', '洞口县', '绥宁县', '武宁县', '城步苗族自治县', '武冈市'],
['岳阳楼区', '君山区', '云溪区', '岳阳县', '平江县', '湘阴县', '华容县', '汨罗市', '临湘市'],
['武陵区', '鼎城区', '安乡县', '汉寿县', '澧县', '临澧县', '桃源县', '石门县', '津市市'],
['永定区', '武陵源区', '慈利县', '桑植县'],
['资阳区', '赫山区', '安化县', '桃江县', '南县', '沅江市', '大通湖区'],
['娄星区', '双峰县', '新化县', '涟源市', '冷水江市'],
['苏仙区', '北湖区', '安仁县', '桂阳县', '永兴县', '宜章县', '嘉禾县', '临武县', '汝城县', '桂东县', '资兴市'],
['零陵区', '冷水滩区', '道县', '祁阳县', '东安县', '双牌县', '江永县', '宁远县', '蓝山县', '新田县', '江华瑶族自治县', '金洞管理区', '回龙圩管理区'],
['鹤城区', '中方县', '沅陵县', '辰溪县', '溆浦县', '会同县', '麻阳苗族自治县']
['新晃侗族自治县', '芷江侗族自治县'],
['靖州苗族侗族自治县', '通道侗族自治县', '洪江市'],
['吉首市', '泸溪县', '凤凰县', '花垣县', '保靖县', '古丈县', '永顺县', '龙山县']
],
/*吉林省*/
[
['南关区', '朝阳区', '绿园区', '二道区', '双阳区', '宽城区', '九台区[7] ', '榆树市', '德惠市', '农安县'],
['船营区', '龙潭区', '昌邑区', '丰满区', '磐石市', '桦甸市', '蛟河市', '舒兰市', '永吉县'],
['铁西区', '铁东区', '双辽市', '梨树县', '伊通满族自治县'],
['龙山区', '西安区', '东丰县', '东辽县'],
['东昌区', '二道江区', '集安市', '通化县', '辉南县', '柳河县'],
['浑江区', '江源区', '临江市', '抚松县', '靖宇县', '长白朝鲜族自治县'],
['洮北区', '洮南市', '大安市', '镇赉县', '通榆县'],
['宁江区', '扶余市', '乾安县', '长岭县', '前郭尔罗斯蒙古族自治县'],
['延吉市', '图们市', '敦化市', '和龙市', '珲春市', '龙井市', '汪清县', '安图县'],
['池北区', '池西区', '池南区']
],
/*江苏省*/
[
['玄武区', '秦淮区', '鼓楼区', '建邺区', '栖霞区', '雨花台区', '江宁区', '浦口区', '六合区', '溧水区', '高淳区'],
['崇安区', '南长区', '北塘区', '锡山区', '惠山区', '滨湖区', '江阴市', '宜兴市'],
['鼓楼区', '云龙区', '贾汪区', '泉山区', '铜山区', '丰县', '沛县', '睢宁县', '邳州市', '新沂市'],
['天宁区', '钟楼区', '戚墅堰区', '新北区', '武进区', '溧阳市', '金坛市'],
['姑苏区', '虎丘区', '吴中区', '相城区', '吴江区', '张家港市', '昆山市', '太仓市', '常熟市'],
['崇川区', '港闸区', '通州区', '海安县', '如东县', '如皋市', '海门市', '启东市'],
['连云区', '海州区', '赣榆区', '东海县', '灌云县', '灌南县'],
['清河区', '清浦区', '淮安区', '淮阴区', '涟水县', '洪泽县', '盱眙县', '金湖县'],
['亭湖区', '盐都区', '响水县', '滨海县', '阜宁县', '射阳县', '建湖县', '东台市', '大丰市'],
['广陵区', '邗江区', '江都区', '宝应县', '仪征市', '高邮市'],
['京口区', '润州区', '丹徒区', '丹阳市', '扬中市', '句容市'],
['海陵区', '高港区', '姜堰区', '兴化市', '靖江市', '泰兴市'],
['宿城区', '宿豫区', '沭阳县', '泗阳县', '泗洪县']
],
/*江西*/
[
['东湖区', '西湖区', '青云谱区', '湾里区', '青山湖区', '南昌县', '新建县', '安义县', '进贤县'],
['浔阳区', '庐山区', '九江县', '共青城市', '瑞昌市', '永修县', '德安县', '星子县', '都昌县', '湖口县', '彭泽县', '武宁县', '修水县'],
['信州区', '上饶县', '广丰县', '玉山县', '铅山县', '横峰县', '弋阳县', '余干县', '鄱阳县', '万年县', '婺源县', '德兴市'],
['临川区', '南城县', '黎川县', '南丰县', '崇仁县', '乐安县', '宜黄县', '金溪县', '资溪县', '东乡县', '广昌县'],
['袁州区', '高安市', '丰城市', '樟树市', '奉新县', '万载县', '上高县', '宜丰县', '靖安县', '铜鼓县'],
['吉州区', '青原区', '吉安县', '井冈山市', '吉水县', '新干县', '永丰县', '泰和县', '遂川县', '万安县', '安福县', '永新县', '峡江县'],
['章贡区', '南康区', '信丰县', '大余县', '赣县', '龙南县', '定南县', '全南县', '寻乌县', '安远县', '瑞金市', '宁都县', '于都县', '会昌县', '石城县', '上犹县', '兴国县', '崇义县'],
['昌江区', '珠山区', '浮梁县', '乐平市'],
['安源区', '湘东区', '莲花县', '上栗县', '芦溪县'],
['渝水区', '分宜县'],
['月湖区', '余江县', '贵溪市']
],
/*辽宁省*/
[
['和平区', '沈河区', '大东区', '皇姑区', '铁西区', '苏家屯区', '浑南区', '沈北新区', '于洪区', '新民市', '辽中县', '康平县', '法库县'],
['西岗区', '中山区', '沙河口区', '甘井子区', '旅顺口区', '金州区', '瓦房店市', '普兰店市', '庄河市', '长海县'],
['铁东区', '铁西区', '立山区', '千山区', '海城市', '台安县', '岫岩满族自治县'],
['新抚区', '东洲区', '望花区', '顺城区', '抚顺县', '新宾满族自治县', '清原满族自治县'],
['平山区', '溪湖区', '明山区', '南芬区', '本溪满族自治县', '桓仁满族自治县'],
['元宝区', '振兴区', '振安区', '东港市', '凤城市', '宽甸满族自治县'],
['古塔区', '凌河区', '太和区', '松山新区', '凌海市', '北镇市', '黑山县', '义县'],
['站前区', '西市区', '老边区', '鲅鱼圈区', '大石桥市', '盖州市'],
['海州区', '太平区', '新邱区', '细河区', '清河门区', '阜新蒙古族自治县', '彰武县'],
['白塔区', '文圣区', '宏伟区', '弓长岭区', '太子河区', '灯塔市', '辽阳县'],
['双台子区', '兴隆台区', '盘山县', '大洼县'],
['银州区', '清河区', '调兵山市', '开原市', '铁岭县', '昌图县', '西丰县'],
['双塔区', '龙城区', '北票市', '凌源市', '朝阳县', '建平县', '喀喇沁左翼蒙古族自治县'],
['连山区', '南票区', '龙港区', '兴城市', '绥中县', '建昌县'],
],
/*内蒙古*/
[
['回民区', '新城区', '玉泉区', '赛罕区', '土默特左旗', '托克托县', '和林格尔县', '武川县', '清水河县'],
['昆都仑区', '东河区', '青山区', '石拐区', '九原区', '白云矿区', '土默特右旗', '固阳县', '达尔罕茂明安联合旗'],
['海勃湾区', '海南区', '乌达区'],
['红山区', '元宝山区', '松山区', '阿鲁科尔沁旗', '巴林左旗', '巴林右旗', '林西县', '克什克腾旗', '翁牛特旗', '喀喇沁旗宁城县', '敖汉旗'],
['科尔沁区', '霍林郭勒市', '科尔沁左翼中旗', '科尔沁左翼后旗', '开鲁县', '库伦旗', '奈曼旗', '扎鲁特旗'],
['东胜区', '达拉特旗', '准格尔旗', '鄂托克前旗', '鄂托克旗', '杭锦旗', '乌审旗', '伊金霍洛旗'],
['海拉尔区', '满洲里市', '牙克石市', '扎兰屯市', '额尔古纳市', '根河市', '阿荣旗', '鄂伦春自治旗', '莫力达瓦达斡尔族自治旗', '鄂温克族自治旗', '陈巴尔虎旗', '新巴尔虎左旗', '新巴尔虎右旗'],
['临河区', '五原县', '磴口县', '乌拉特前旗', '乌拉特中旗', '乌拉特后旗', '杭锦后旗'],
['集宁区', '丰镇市', '卓资县', '化德县', '商都县', '兴和县', '凉城县', '察哈尔右翼前旗', '察哈尔右翼中旗', '察哈尔右翼后旗', '四子王旗'],
['乌兰浩特市', '阿尔山市', '科尔沁右翼前旗', '科尔沁右翼中旗', '扎赉特旗', '突泉县'],
['锡林浩特市', '二连浩特市', '阿巴嘎旗', '苏尼特左旗', '苏尼特右旗', '东乌珠穆沁旗', '西乌珠穆沁旗', '太仆寺旗', '镶黄旗', '正镶白旗', '正蓝旗', '多伦县'],
['阿拉善左旗', '阿拉善右旗', '额济纳旗']
],
/*宁夏*/
[
['兴庆区', '金凤区', '西夏区灵武市', '永宁县', '贺兰县'],
['大武口区', '惠农区', '平罗县'],
['利通区', '红寺堡区', '青铜峡市', '同心县', '盐池县'],
['原州区西吉县', '隆德县', '泾源县', '彭阳县'],
['沙坡头区中宁县', '海原县']
],
/*青海省*/
[
['城中区', '城东区', '城西区', '城北区', '大通回族土族自治县', '湟中县', '湟源县'],
['乐都区', '平安县', '民和回族土族自治县', '互助土族自治县', '化隆回族自治县', '循化撒拉族自治县'],
['海晏县（三角城镇）', '祁连县', '刚察县', '门源回族自治县'],
['同仁县（隆务镇）', '尖扎县', '泽库县', '河南蒙古族自治县'],
['共和县（恰卜恰镇）', '同德县', '贵德县', '兴海县', '贵南县'],
['玛沁县（大武镇）', '班玛县', '甘德县', '达日县', '久治县', '玛多县'],
['玉树市（结古镇）', '杂多县', '称多县', '治多县', '囊谦县', '曲麻莱县'],
['德令哈市', '格尔木市', '天峻县', '都兰县', '乌兰县']

],
/*山东省*/
[
['历下区', '市中区', '槐荫区', '天桥区', '历城区', '长清区', '章丘市', '平阴县', '济阳县', '商河县'],
['市南区', '市北区', '李沧区', '城阳区', '崂山区', '黄岛区', '即墨市', '胶州市', '平度市', '莱西市'],
['淄川区', '周村区', '博山区', '临淄区', '桓台县', '高青县', '沂源县'],
['薛城区', '市中区', '峄城区', '山亭区', '台儿庄区', '滕州市'],
['东营区', '河口区', '广饶县', '垦利县', '利津县'],
['莱山区', '芝罘区', '福山区', '牟平区', '龙口市', '莱阳市', '莱州市', '蓬莱市', '招远市', '栖霞市', '海阳市', '长岛县'],
['奎文区', '潍城区', '寒亭区', '坊子区', '诸城市', '青州市', '寿光市', '安丘市', '昌邑市', '高密市', '临朐县', '昌乐县'],
['任城区', '兖州区', '邹城市', '曲阜市', '嘉祥县', '汶上县', '梁山县', '微山县', '鱼台县', '金乡县', '泗水县'],
['泰山区', '岱岳区', '新泰市', '肥城市', '宁阳县', '东平县'],
['环翠区', '文登区', '荣成市', '乳山市'],
['东港区', '岚山区', '五莲县', '莒县'],
['滨城区', '沾化区', '惠民县', '阳信县', '无棣县', '博兴县', '邹平县'],
['德城区', '陵城区', '乐陵市', '禹城市', '临邑县', '平原县', '夏津县', '武城县', '庆云县', '宁津县', '齐河县'],
['东昌府区', '临清市', '茌平县', '东阿县', '高唐县', '阳谷县', '冠县', '莘县'],
['兰山区', '河东区', '罗庄区', '兰陵县', '郯城县', '莒南县', '沂水县', '蒙阴县', '平邑县', '沂南县', '临沭县', '费县'],
['牡丹区', '曹县', '单县', '巨野县', '定陶县', '成武县', '郓城县', '鄄城县', '东明县'],
['莱城区', '钢城区']
],
/*山西*/
[
['迎泽区', '杏花岭区', '万柏林区', '尖草坪区', '小店区', '晋源区', '清徐县', '阳曲县', '娄烦县', '古交市'],
['城区', '矿区', '南郊区', '新荣区', '左云县', '大同县', '天镇县', '浑源县', '广灵县', '灵丘县', '阳高县'],
['城区', '矿区', '郊区', '盂县', '平定县'],
['城区', '郊区', '长治县', '襄垣县', '屯留县', '平顺县', '黎城县', '壶关县', '长子县', '武乡县', '沁县', '沁源县	', '潞城市'],
['城区', '泽州县', '阳城县', '陵川县', '沁水县', '高平市'],
['朔城区', '平鲁区', '山阴县', '应县', '怀仁县', '右玉县'],
['榆次区', '榆社县', '左权县', '和顺县', '昔阳县', '寿阳县', '太谷县', '祁县	', '平遥县', '灵石县', '介休市'],
['盐湖区', '临猗县', '芮城县', '万荣县', '新绛县', '稷山县', '闻喜县', '夏县', '绛县', '平陆县', '垣曲县', '河津市', '永济市'],
['忻府区', '定襄县', '五台县', '代县	', '繁峙县', '宁武县', '静乐县', '神池县', '五寨县', '岢岚县', '偏关县', '河曲县', '保德县', '原平市'],
['尧都区', '曲沃县', '翼城县', '襄汾县', '洪洞县', '古县', '浮山县', '吉县', '乡宁县', '蒲县 ', '大宁县', '永和县', '汾西县', '隰县', '安泽县', '侯马市', '霍州市'],
['离石区', '文水县', '交城县', '兴县', '临县', '柳林县', '岚县', '石楼县', '交口县', '方山县', '中阳县', '孝义市', '汾阳市']
],
/*陕西省*/
[
['新城区', '碑林区', '莲湖区', '灞桥区', '未央区', '雁塔区', '阎良区', '临潼区', '长安区', '蓝田县', '周至县', '户县', '高陵县'],
['渭滨区', '金台区', '陈仓区', '凤翔县', '岐山县', '扶风县', '眉县', '陇县', '千阳县', '麟游县', '凤县', '太白县'],
['秦都区', '渭城区', '兴平市', '三原县', '泾阳县', '武功县', '乾县', '礼泉县', '永寿县', '彬县', '长武县', '旬邑县', '淳化县'],
['蒲城县', '富平县', '临渭区', '韩城市', '华阴市', '华县', '潼关县', '大荔县', '合阳县', '澄城县', '白水县'],
['耀州区', '王益区', '印台区', '宜君县'],
['宝塔区', '延长县', '延川县', '子长县', '安塞县', '志丹县', '吴起县', '甘泉县', '富县', '洛川县', '宜川县', '黄龙县', '黄陵县'],
['榆阳区', '神木县', '府谷县', '横山县', '靖边县', '定边县', '绥德县', '米脂县', '佳县', '吴堡县', '清涧县', '子洲县'],
['汉滨区', '高新区', '旬阳县', '石泉县', '平利县', '汉阴县', '宁陕县', '紫阳县', '岚皋县', '镇坪县', '白河县'],
['汉台区', '南郑县', '城固县', '洋县', '西乡县', '勉县', '宁强县', '略阳县', '镇巴县', '留坝县', '佛坪县'],
['商州区', '洛南县', '丹凤县', '商南县', '山阳县', '镇安县', '柞水县'],
['杨陵区'],
],

/*四川省*/
[
['锦江区', '青羊区', '金牛区', '武侯区', '成华区', '青白江区', '龙泉驿区', '新都区', '温江区', '金堂县', '双流县', '郫县', '大邑县', '蒲江县', '新津县', '都江堰市', '彭州市', '崇州市', '邛崃市'],
['涪城区', '游仙区', '梓潼县', '三台县', '盐亭县', '安县', '平武县', '江油市', '北川羌族自治县'],
['自流井区', '贡井区', '大安区', '沿滩区', '荣县', '富顺县'],
['东区', '西区', '仁和区', '米易县', '盐边县'],
['江阳区', '龙马潭区', '纳溪区', '泸县', '合江县', '叙永县', '古蔺县'],
['旌阳区', '广汉市', '什邡市', '绵竹市', '中江县', '罗江县'],
['利州区', '昭化区', '朝天区', '旺苍县', '青川县', '剑阁县', ' 苍溪县'],
['船山区', '安居区', '射洪县', '蓬溪县', '大英县'],
['市中区', '东兴区', '资中县', '隆昌县', '威远县'],
['市中区', '沙湾区', '五通桥区', '金口河区', '犍为县', '井研县', '夹江县', '沐川县', '峨眉山市', '峨边彝族自治县', '马边彝族自治县'],
['雁江区', '安岳县', '乐至县', '简阳市'],
['翠屏区', '南溪区', '宜宾县', '江安县', '长宁县', '高县', '筠连县', '珙县', '兴文县', '屏山县'],
['顺庆区', '高坪区', '嘉陵区', '西充县', '南部县', '蓬安县', '营山县', '仪陇县', '阆中市'],
['通川区', '达川区', '宣汉县', '开江县', '大竹县', '渠县', '万源市'],
['雨城区', '名山区', '荥经县', '汉源县', '石棉县', '天全县', '芦山县', '宝兴县'],
['马尔康县', '金川县', '小金县', '阿坝县', '若尔盖县', '红原县', '壤塘县', '汶川县', '理县', '茂县', '松潘县', '九寨沟县', '黑水县'],
['康定县', '泸定县', '九龙县', '道孚县', '炉霍县', '甘孜县', '新龙县', '德格县', '白玉县', '石渠县', '色达县', '理塘县', '巴塘县', '乡城县', '稻城县', '得荣县'],
['西昌市', '德昌县', '会理县', '会东县', '宁南县', '普格县', '布拖县', '昭觉县', '金阳县', '雷波县', '美姑县', '甘洛县', '越西县', '喜德县', '冕宁县', '盐源县', '木里藏族自治县'],
['广安区', '前锋区', '邻水县', '武胜县', '岳池县', '华蓥市'],
['巴州区', '恩阳区', '平昌县', '通江县', '南江县'],
['东坡区', '彭山区', '仁寿县', '丹棱县', '青神县', '洪雅县'],
],
/*台湾*/
[
['台北'],
['阿莲'],
['安定'],
['安平'],
['八德'],
['八里'],
['白河'],
['白沙'],
['板桥'],
['褒忠'],
['宝山'],
['卑南'],
['北斗'],
['北港'],
['北门'],
['北埔'],
['北投'],
['补子'],
['布袋'],
['草屯'],
['长宾'],
['长治'],
['潮州'],
['车城'],
['成功'],
['城中区'],
['池上'],
['春日'],
['刺桐'],
['高雄'],
['花莲'],
['基隆'],
['嘉义'],
['苗栗'],
['南投'],
['屏东'],
['台东'],
['台南'],
['台中'],
['桃园'],
['新竹'],
['宜兰'],
['彰化']
],
/*西藏*/
[
['达孜', '当雄', '堆龙德庆', '拉萨市', '林周', '墨竹工卡', '尼木', '曲水'],
['措勤', '噶尔', '改则', '革吉', '普兰', '日土', '札达'],
['八宿', '边坝', '察雅', '昌都', '丁青', '贡觉', '江达', '类乌齐', '洛隆', '芒康', '左贡'],
['波密', '察隅', '工布江达', '朗县', '林芝', '米林', '墨脱'],
['安多', '巴青', '班戈', '比如', '嘉黎', '那曲', '尼玛', '聂荣', '申扎', '索县'],
['昂仁', '白朗', '定结', '定日', '岗巴', '吉隆', '江孜', '康马', '拉孜', '南木林', '聂拉木', '仁布', '日喀则市', '萨嘎', '萨迦', '谢通门', '亚东', '仲巴'],
['措美', '错那', '贡嘎', '加查', '浪卡子', '隆子', '洛扎', '乃东', '琼结', '曲松', '桑日', '扎囊']
],
[

     ['中西区', '湾仔区', '东区', '南区'],
     ['油尖旺区', '深水埗区', '九龙城区', '黄大仙区', '观塘区'],
     ['北区', '大埔区', '沙田区', '西贡区', '荃湾区', '屯门区', '元朗区', '葵青区', '离岛区']

],


/*新疆*/
[
['乌鲁木齐市', '乌鲁木齐县'],
['阿克苏市', '阿瓦提', '拜城', '柯坪', '库车', '沙雅', '温宿', '乌什', '新和'],
['阿拉尔'],
['阿勒泰', '布尔津', '福海', '富蕴', '哈巴河', '吉木乃', '青河'],
['博湖', '和静', '和硕', '库尔勒', '轮台', '且末', '若羌', '尉犁', '焉耆'],
['博乐', '精河', '温泉'],
['昌吉市', '阜康', '呼图壁', '吉木萨尔', '玛纳斯', '米泉', '木垒', '奇台'],
['巴里坤', '哈密市', '伊吾'],
['策勒', '和田市', '和田县', '洛浦', '民丰', '墨玉', '皮山', '于田'],
['巴楚', '伽师', '喀什市', '麦盖提', '莎车', '疏附', '疏勒', '塔什库尔干塔吉克', '叶城', '英吉沙', '岳普湖', '泽普'],
['克拉玛依'],
['阿合奇', '阿克陶', '阿图什', '乌恰'],
['石河子'],
['额敏', '和布克赛尔', '沙湾', '塔城市', '托里', '乌苏', '裕民'],
['图木舒克'],
['鄯善', '吐鲁番市', '托克逊'],
['五家渠'],
['察布查尔锡伯', '巩留', '霍城', '奎屯', '尼勒克', '特克斯', '新源', '伊宁市', '伊宁县', '昭苏']
],
/*云南*/
[
['呈贡区', '盘龙区', '五华区', '官渡区', '西山区', '东川区', '安宁市', '晋宁县', '富民县', '宜良县', '嵩明县', '石林彝族自治县', '禄劝彝族苗族自治县', '寻甸回族彝族自治县'],
['麒麟区', '宣威市', '马龙县', '沾益县', '富源县', '罗平县', '师宗县', '陆良县', '会泽县'],
['红塔区', '江川县', '澄江县', '通海县', '华宁县', '易门县', '峨山彝族自治县', '新平彝族傣族自治县', '元江哈尼族彝族傣族自治县'],
['隆阳区', '施甸县', '腾冲县', '龙陵县', '昌宁县'],
['昭阳区', '鲁甸县', '巧家县', '盐津县', '大关县', '永善县', '绥江县', '镇雄县', '彝良县', '威信县', '水富县'],
['古城区', '永胜县', '华坪县', '玉龙纳西族自治县', '宁蒗彝族自治县'],
['思茅区', '宁洱哈尼族彝族自治县', '墨江哈尼族自治县', '景东彝族自治县', '景谷傣族彝族自治县', '镇沅彝族哈尼族拉祜族自治县', '江城哈尼族彝族自治县', '孟连傣族拉祜族佤族自治县', '澜沧拉祜族自治县', '西盟佤族自治县'],
['临翔区', '凤庆县', '云县', '永德县', '镇康县', '双江拉祜族佤族布朗族傣族自治县', '耿马傣族佤族自治县', '沧源佤族自治县'],
['芒市', '瑞丽市', '梁河县', '盈江县', '陇川县'],
['泸水县', '福贡县', '贡山独龙族怒族自治县', '兰坪白族普米族自治县'],
['香格里拉县', '德钦县', '维西傈僳族自治县'],
['大理市', '祥云县', '宾川县', '弥渡县', '永平县', '云龙县', '洱源县', '剑川县', '鹤庆县', '漾濞彝族自治县', '南涧彝族自治县', '巍山彝族回族自治县'],
['楚雄市', '双柏县', '牟定县', '南华县', '姚安县', '大姚县', '永仁县', '元谋县', '武定县', '禄丰县'],
['蒙自市', '个旧市', '开远市', '绿春县', '建水县', '石屏县', '弥勒市', '泸西县', '元阳县', '红河县', '金平苗族瑶族傣族自治县', '河口瑶族自治县', '屏边苗族自治县'],
['文山市', '砚山县', '西畴县', '麻栗坡县', '马关县', '丘北县', '广南县', '富宁县'],
['景洪市', '勐海县', '勐腊县']
],
/*浙江省*/
[
['上城区', '下城区', '江干区', '拱墅区', '西湖区', '滨江区', '余杭区', '萧山区', '建德市', '富阳市', '临安市', '桐庐县', '淳安县'],
['海曙区', '江东区', '江北区', '北仑区', '镇海区', '鄞州区', '余姚市', '慈溪市', '奉化市', '象山县', '宁海县'],
['鹿城区', '龙湾区', '瓯海区', '瑞安市', '乐清市', '洞头县', '永嘉县', '平阳县', '苍南县', '文成县', '泰顺县'],
['越城区', '柯桥区', '上虞区', '诸暨市', '嵊州市', '新昌县'],
['吴兴区', '南浔区', '德清县', '长兴县', '安吉县'],
['南湖区', '秀洲区', '海宁市', '平湖市', '桐乡市', '嘉善县', '海盐县'],
['婺城区', '金东区', '兰溪市', '东阳市', '永康市', '义乌市', '武义县', '浦江县', '磐安县'],
['柯城区', '衢江区', '江山市', '常山县', '开化县', '龙游县'],
['定海区', '普陀区', '岱山县', '嵊泗县'],
['椒江区', '黄岩区', '路桥区', '温岭市', '临海市', '玉环县', '三门县', '天台县', '仙居县'],
['莲都区', '龙泉市', '青田县', '缙云县　遂昌县', '松阳县', '云和县', '庆元县', '景宁畲族自治县']
],

[
['Alberta', 'British Columbia', 'Manitoba', 'New Foundland and Labrador', 'New Brunswick', 'Northwest Territories', 'Nova Scotia', 'Nunavut Territory', 'Ontario', 'Prince Edward Island', 'Quebec', 'Saskatchewan', 'Yukon Territory'],
['阿根廷'],
['埃及'],
['爱尔兰'],
['奥地利'],
['奥克兰'],
['澳大利亚'],
['巴基斯坦'],
['巴西'],
['保加利亚'],
['比利时'],
['冰岛'],
['朝鲜'],
['丹麦'],
['德国'],
['俄罗斯'],
['法国'],
['菲律宾'],
['芬兰'],
['哥伦比亚'],
['韩国'],
['荷兰'],
['柬埔寨'],
['喀麦隆'],
['老挝'],
['卢森堡'],
['罗马尼亚'],
['马达加斯加'],
['马来西亚'],
['毛里求斯'],
['美国'],
['秘鲁'],
['缅甸'],
['墨西哥'],
['南非'],
['尼泊尔'],
['挪威'],
['葡萄牙'],
['其它地区'],
['日本'],
['瑞典'],
['瑞士'],
['斯里兰卡'],
['泰国'],
['土耳其'],
['委内瑞拉'],
['文莱'],
['乌克兰'],
['西班牙'],
['希腊'],
['新加坡'],
['新西兰'],
['匈牙利'],
['以色列'],
['意大利'],
['印度'],
['印度尼西亚'],
['英国'],
['越南'],
['智利']
]
]